package org.example;

public class description {
    /**Реализовать акт коммуникации между тремя агентами (1 агент покупатель, 2 агента-продавца)
     * используя сервис DF для поиска агентов-продавцов, с целью получения наиболее выгодной цены на заранее заданную
     * книгу по принципу: Запрос-Ожидание-Обработка ответа. Рассмотреть ситуацию отказа продавца, ввиду отсутствия
     * требуемой книги. Цена у агентов продавцов должна формироваться случайным образом в заданных пределах
     * (принять диапазон 200 – 400 р).*/
}